import { mockImages } from './image';

export const categories = [
    { id: 1, name: "เหรียญ", image: mockImages.categories.coin },
    { id: 2, name: "เครื่องราง", image: mockImages.categories.amulet },
    { id: 3, name: "พระบูชา", image: mockImages.categories.book },
    { id: 4, name: "หนังสือ", image: mockImages.categories.statue },
];

export const product = [
    {
        id: 1,
        name: "เหรียญรุ่นแรก หลวงพ่อคูณ ปี 2512",
        price: 15000,
        originalPrice: 18000,
        description: "สภาพสวย เดิมๆ จากวัด",
        image: mockImages.product.product1,
        discount: 15,
        sold: 50,
        category: "เหรียญ"
    },
    {
        id: 2,
        name: "เหรียญเสมาหลวงพ่อโสธร ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product2,
        discount: 20,
        sold: 30,
        category: "เหรียญ"
    },
    {
        id: 3,
        name: "หนังสือ ทรัพย์แผ่นดินสยาม",
        price: 500,
        originalPrice: 1200,
        description: "เพื่อเผยแพร่สู่สาธารณชน",
        image: mockImages.product.product3,
        discount: 50,
        sold: 30,
        category: "หนังสือ"
    },
    {
        id: 4,
        name: "เครื่องราง เขี้ยวเสือแกะ",
        price: 3500,
        originalPrice: 4000,
        description: "เครื่องรางของขลังแท้",
        image: mockImages.product.product4,
        discount: 10,
        sold: 15,
        category: "เครื่องราง"
    },
    {
        id: 5,
        name: "หนังสือ ปาฏิหาริย์หลวงปู่ทวด",
        price: 600,
        originalPrice: 1000,
        description: "หนังสือหายากจากยุคแรก",
        image: mockImages.product.product5,
        discount: 40,
        sold: 12,
        category: "หนังสือ"
    },
    {
        id: 6,
        name: "พระบูชา ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product5,
        discount: 20,
        sold: 30,
        category: "พระบูชา"
    },
    {
        id: 2,
        name: "เหรียญเสมาหลวงพ่อโสธร ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product2,
        discount: 20,
        sold: 30,
        category: "เหรียญ"
    },
    {
        id: 2,
        name: "เหรียญเสมาหลวงพ่อโสธร ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product2,
        discount: 20,
        sold: 30,
        category: "เหรียญ"
    },
    {
        id: 2,
        name: "เหรียญเสมาหลวงพ่อโสธร ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product2,
        discount: 20,
        sold: 30,
        category: "เหรียญ"
    },
    {
        id: 2,
        name: "เหรียญเสมาหลวงพ่อโสธร ปี 2460",
        price: 25000,
        originalPrice: 30000,
        description: "หายาก สภาพสวยมาก",
        image: mockImages.product.product2,
        discount: 20,
        sold: 30,
        category: "เหรียญ"
    },
];


export const timeline = [
    {
        date: '2024-12-15',
        items: [
            {
                title: 'โครงการนำสุ่ง แม่บุญ',
                detail: 'มูลค่า 64,000,000 บาท',
            },
            {
                title: 'โครงการนำสุ่ง เคหะจัง',
                detail: 'มูลค่า 76,000,000 บาท',
            },
            {
                title: 'โครงการนำสุ่ง เคหะจัง',
                detail: 'มูลค่า 76,000,000 บาท',
            },
        ],
    },
    {
        date: '2024-11-20',
        items: [
            {
                title: 'โครงการนำสุ่ง แบบบุญ 1',
                detail: 'มูลค่า 48,000,000 บาท',
            },
            {
                title: 'โครงการนำสุ่ง แบบบุญ 2',
                detail: 'มูลค่า 206,000,000 บาท',
            },
        ],
    },
    {
        date: '2024-04-10',
        items: [
            {
                title: 'โครงการนำสุ่ง เคหะวงศ์ 1',
                detail: 'มูลค่า 61,000,000 บาท',
            },
            {
                title: 'โครงการนำสุ่ง เคหวิถี - ถนนพา',
                detail: 'มูลค่า 64,000,000 บาท',
            },
        ],
    },
    {
        date: '2023-01-15',
        items: [
            {
                title: 'โครงการนำสุ่ง เคหะวงศ์ 1',
                detail: 'มูลค่า 61,000,000 บาท',
            },
            {
                title: 'โครงการนำสุ่ง เคหวิถี - ถนนพา',
                detail: 'มูลค่า 64,000,000 บาท',
            },
        ],
    },
];

export const newsData = [
    {
        id: 1,
        title: 'การประชุมคณะกรรมการวินิจฉัยการเปิดเผยข้อมูลข่าวสารสาขาสังคม',
        description: '#พิธีรดน้ำสังข์ หรือ #พิธีหลั่งน้ำพระพุทธมนต์ ถือเป็นอีกหนึ่งไฮไลท์ของงานวิวาห์ที่ทำให้บ่าวสาวหลายคู่ซาบซึ้งใจจนหลั่งน้ำตา โดยพิธีนี้มีมาแต่โบราณ เป็นไปตามขนบธรรมเนียมประเพณีไทย ผู้หลักผู้ใหญ่ที่เคารพนับถือหลายท่านต่างก็มาร่วมรดน้ำและให้พรอันประเสริฐ อีกทั้งยังถือเป็นพิธีศักดิ์สิทธิ์ ใช้สิ่งของมงคล เหตุที่ใช้หอย #สังข์มงคล มาเป็นภาชนะใส่น้ำพระพุทธมนต์หลั่งอวยพรให้คู่บ่าวสาวนั้น เพราะว่าหอยสังข์เป็นหนึ่งในสิ่งศักดิ์สิทธิ์ 14 อย่าง อันเกิดจากการกวนเกษียรสมุทรของเหล่าเทวดากับอสูร และยังเป็นหนึ่งใน 4 อย่างที่พระนารายณ์ทรงถือ ด้วยเหตุนี้หอยสังข์จึงเป็นของศักดิ์สิทธิ์ที่อุดมมงคลอย่างสูงและถูกนำมาใช้ในพิธีมงคลสมรสน้ำเป็นสัญลักษณ์ของความเป็นอันหนึ่งอันเดียวกัน ดังนั้นการใช้น้ำหลั่งอวยพรให้คู่บ่าวสาวจึงเสมือนเป็นการอวยพรให้ครองรักกันยั่งยืน อีกทั้ง #น้ำพระพุทธมนต์ ที่หลั่งออกมาจากสังข์ยังถือเป็นน้ำศักดิ์สิทธิ์ที่ช่วยเสริมสิริมงคลแก่คู่บ่าวสาวอีกด้วยนอกจากพิธีมงคลสมรสแล้ว น้ำพุทธมนต์ที่หลั่งมาจากสังข์มงคล สามารถ เสริมความเป็นสิริมงคลกับทุกคนได้ สามารถนำมา อาบน้ำ ล้างหน้า เพื่อ เสริมความมงคลในทุกเช้า วิธีใช้ จะนำน้ำ ผ่าน ไปยังสังข์มงคล หาใช่นำสังข์มงคลมาวักน้ำ แต่อย่างใด #สมุดปูม#มหาสังข์แม่กำไลสามารถอ่านบทความดีๆ และ เข้าไปหาสังข์มงคลเพื่อเป็นสิริมงคล ที่บ้านได้❤️❤️❤️❤️Shop❤️❤️❤️❤️👉🏻https://bit.ly/3AL8p37www.siamcoin.com',
        date: '31 ธันวาคม 2567',
        time: '09.30 น.',
        location: 'ห้องประชุม 307 ชั้น 3 อาคาร สปน.',
        image: mockImages.news.new1,
        type: 'การประชุม'
    },
    {
        id: 2,
        title: 'การประชุมคณะกรรมการวินิจฉัยการเปิดเผยข้อมูลข่าวสารสาขาสังคม',
        description: '#พิธีรดน้ำสังข์ หรือ #พิธีหลั่งน้ำพระพุทธมนต์ ถือเป็นอีกหนึ่งไฮไลท์ของงานวิวาห์ที่ทำให้บ่าวสาวหลายคู่ซาบซึ้งใจจนหลั่งน้ำตา โดยพิธีนี้มีมาแต่โบราณ เป็นไปตามขนบธรรมเนียมประเพณีไทย ผู้หลักผู้ใหญ่ที่เคารพนับถือหลายท่านต่างก็มาร่วมรดน้ำและให้พรอันประเสริฐ อีกทั้งยังถือเป็นพิธีศักดิ์สิทธิ์ ใช้สิ่งของมงคล เหตุที่ใช้หอย #สังข์มงคล มาเป็นภาชนะใส่น้ำพระพุทธมนต์หลั่งอวยพรให้คู่บ่าวสาวนั้น เพราะว่าหอยสังข์เป็นหนึ่งในสิ่งศักดิ์สิทธิ์ 14 อย่าง อันเกิดจากการกวนเกษียรสมุทรของเหล่าเทวดากับอสูร และยังเป็นหนึ่งใน 4 อย่างที่พระนารายณ์ทรงถือ ด้วยเหตุนี้หอยสังข์จึงเป็นของศักดิ์สิทธิ์ที่อุดมมงคลอย่างสูงและถูกนำมาใช้ในพิธีมงคลสมรสน้ำเป็นสัญลักษณ์ของความเป็นอันหนึ่งอันเดียวกัน ดังนั้นการใช้น้ำหลั่งอวยพรให้คู่บ่าวสาวจึงเสมือนเป็นการอวยพรให้ครองรักกันยั่งยืน อีกทั้ง #น้ำพระพุทธมนต์ ที่หลั่งออกมาจากสังข์ยังถือเป็นน้ำศักดิ์สิทธิ์ที่ช่วยเสริมสิริมงคลแก่คู่บ่าวสาวอีกด้วยนอกจากพิธีมงคลสมรสแล้ว น้ำพุทธมนต์ที่หลั่งมาจากสังข์มงคล สามารถ เสริมความเป็นสิริมงคลกับทุกคนได้ สามารถนำมา อาบน้ำ ล้างหน้า เพื่อ เสริมความมงคลในทุกเช้า วิธีใช้ จะนำน้ำ ผ่าน ไปยังสังข์มงคล หาใช่นำสังข์มงคลมาวักน้ำ แต่อย่างใด #สมุดปูม#มหาสังข์แม่กำไลสามารถอ่านบทความดีๆ และ เข้าไปหาสังข์มงคลเพื่อเป็นสิริมงคล ที่บ้านได้❤️❤️❤️❤️Shop❤️❤️❤️❤️👉🏻https://bit.ly/3AL8p37www.siamcoin.com',

        date: '31 ธันวาคม 2567',
        time: '09.30 น.',
        location: 'ห้องประชุม 307 ชั้น 3 อาคาร สปน.',
        image: mockImages.news.new2,
        type: 'การประชุม'
    },
    {
        id: 3,
        title: 'การประชุมคณะกรรมการวินิจฉัยการเปิดเผยข้อมูลข่าวสารสาขาสังคม',
        description: '#พิธีรดน้ำสังข์ หรือ #พิธีหลั่งน้ำพระพุทธมนต์ ถือเป็นอีกหนึ่งไฮไลท์ของงานวิวาห์ที่ทำให้บ่าวสาวหลายคู่ซาบซึ้งใจจนหลั่งน้ำตา โดยพิธีนี้มีมาแต่โบราณ เป็นไปตามขนบธรรมเนียมประเพณีไทย ผู้หลักผู้ใหญ่ที่เคารพนับถือหลายท่านต่างก็มาร่วมรดน้ำและให้พรอันประเสริฐ อีกทั้งยังถือเป็นพิธีศักดิ์สิทธิ์ ใช้สิ่งของมงคล เหตุที่ใช้หอย #สังข์มงคล มาเป็นภาชนะใส่น้ำพระพุทธมนต์หลั่งอวยพรให้คู่บ่าวสาวนั้น เพราะว่าหอยสังข์เป็นหนึ่งในสิ่งศักดิ์สิทธิ์ 14 อย่าง อันเกิดจากการกวนเกษียรสมุทรของเหล่าเทวดากับอสูร และยังเป็นหนึ่งใน 4 อย่างที่พระนารายณ์ทรงถือ ด้วยเหตุนี้หอยสังข์จึงเป็นของศักดิ์สิทธิ์ที่อุดมมงคลอย่างสูงและถูกนำมาใช้ในพิธีมงคลสมรสน้ำเป็นสัญลักษณ์ของความเป็นอันหนึ่งอันเดียวกัน ดังนั้นการใช้น้ำหลั่งอวยพรให้คู่บ่าวสาวจึงเสมือนเป็นการอวยพรให้ครองรักกันยั่งยืน อีกทั้ง #น้ำพระพุทธมนต์ ที่หลั่งออกมาจากสังข์ยังถือเป็นน้ำศักดิ์สิทธิ์ที่ช่วยเสริมสิริมงคลแก่คู่บ่าวสาวอีกด้วยนอกจากพิธีมงคลสมรสแล้ว น้ำพุทธมนต์ที่หลั่งมาจากสังข์มงคล สามารถ เสริมความเป็นสิริมงคลกับทุกคนได้ สามารถนำมา อาบน้ำ ล้างหน้า เพื่อ เสริมความมงคลในทุกเช้า วิธีใช้ จะนำน้ำ ผ่าน ไปยังสังข์มงคล หาใช่นำสังข์มงคลมาวักน้ำ แต่อย่างใด #สมุดปูม#มหาสังข์แม่กำไลสามารถอ่านบทความดีๆ และ เข้าไปหาสังข์มงคลเพื่อเป็นสิริมงคล ที่บ้านได้❤️❤️❤️❤️Shop❤️❤️❤️❤️👉🏻https://bit.ly/3AL8p37www.siamcoin.com',

        date: '31 ธันวาคม 2567',
        time: '09.30 น.',
        location: 'ห้องประชุม 307 ชั้น 3 อาคาร สปน.',
        image: mockImages.news.new3,
        type: 'การประชุม'
    },
];